grblHAL/STM32F4xx/Src/serial.c
/*

  serial.c - serial port implementation for STM32F4xx ARM processors

  Part of grblHAL

  Copyright (c) 2019-2025 Terje Io

  grblHAL is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  grblHAL is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with grblHAL. If not, see <http://www.gnu.org/licenses/>.

*/

#include <string.h>

#include "main.h"
#include "driver.h"

#include "grbl/hal.h"
#include "grbl/protocol.h"
#include "grbl/stream.h"

#ifdef SERIAL_PORT
static stream_rx_buffer_t rxbuf = {0};
static stream_tx_buffer_t txbuf = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command;
static const io_stream_t *serialInit (uint32_t baud_rate);
#else
#define SERIAL_PORT 0
#endif

#ifdef SERIAL1_PORT
#if !SERIAL_PORT
#error "Add SERIAL_PORT before adding SERIAL1_PORT!"
#endif
static stream_rx_buffer_t rxbuf1 = {0};
static stream_tx_buffer_t txbuf1 = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command1;
static const io_stream_t *serial1Init(uint32_t baud_rate);
#else
#define SERIAL1_PORT 0
#endif

#ifdef SERIAL2_PORT
#if !SERIAL1_PORT
#error "Add SERIAL1_PORT before adding SERIAL2_PORT!"
#endif
static stream_rx_buffer_t rxbuf2 = {0};
static stream_tx_buffer_t txbuf2 = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command2;
static const io_stream_t *serial2Init(uint32_t baud_rate);
#else
#define SERIAL2_PORT 0
#endif

#if SERIAL_PORT

#if SERIAL_PORT == SERIAL1_PORT || SERIAL_PORT == SERIAL2_PORT
#error Conflicting use of UART peripherals!
#endif

#if (SERIAL_PORT >= 10 && SERIAL_PORT < 19)
#define UART0            usart(1)
#define UART0_IRQ        usartINT(1)
#define UART0_IRQHandler usartHANDLER(1)
#define UART0_CLK_En     usartCLKEN(1)
#elif (SERIAL_PORT >= 20 && SERIAL_PORT < 29)
#define UART0            usart(2)
#define UART0_IRQ        usartINT(2)
#define UART0_IRQHandler usartHANDLER(2)
#define UART0_CLK_En     usartCLKEN(2)
#elif (SERIAL_PORT >= 30 && SERIAL_PORT < 39)
#define UART0            usart(3)
#define UART0_IRQ        usartINT(3)
#define UART0_IRQHandler usartHANDLER(3)
#define UART0_CLK_En     usartCLKEN(3)
#else
#define UART0            usart(SERIAL_PORT)
#define UART0_IRQ        usartINT(SERIAL_PORT)
#define UART0_IRQHandler usartHANDLER(SERIAL_PORT)
#define UART0_CLK_En     usartCLKEN(SERIAL_PORT)
#endif
#if SERIAL_PORT == 1 || (SERIAL_PORT >= 10 && SERIAL_PORT < 19) || SERIAL_PORT == 6
#define UART0_CLK HAL_RCC_GetPCLK2Freq()
#else
#define UART0_CLK HAL_RCC_GetPCLK1Freq()
#endif

#if SERIAL_PORT == 1
#define UART0_TX_PIN 9
#define UART0_RX_PIN 10
#define UART0_PORT GPIOA
#define UART0_AF GPIO_AF7_USART1
#elif SERIAL_PORT == 11
#define UART0_TX_PIN 6
#define UART0_RX_PIN 7
#define UART0_PORT GPIOB
#define UART0_AF GPIO_AF7_USART1
#elif SERIAL_PORT == 2
#define UART0_TX_PIN 2
#define UART0_RX_PIN 3
#define UART0_PORT GPIOA
#define UART0_AF GPIO_AF7_USART2
#elif SERIAL_PORT == 21
#define UART0_TX_PIN 5
#define UART0_RX_PIN 6
#define UART0_PORT GPIOD
#define UART0_AF GPIO_AF7_USART2
#elif SERIAL_PORT == 3
#define UART0_TX_PIN 10
#define UART0_RX_PIN 11
#define UART0_PORT GPIOB
#define UART0_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 31
#define UART0_TX_PIN 10
#define UART0_RX_PIN 11
#define UART0_PORT GPIOC
#define UART0_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 32
#define UART0_TX_PIN 8
#define UART0_RX_PIN 9
#define UART0_PORT GPIOD
#define UART0_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 33
#define UART0_TX_PIN 8
#define UART0_RX_PIN 5
#define UART0_PORT GPIOC
#define UART0_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 34
#define UART0_TX_PIN 8
#define UART0_RX_PIN 5
#define UART0_TX_PORT GPIOD
#define UART0_RX_PORT GPIOC
#define UART0_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 6
#define UART0_TX_PIN 6
#define UART0_RX_PIN 7
#define UART0_PORT GPIOC
#define UART0_AF GPIO_AF8_USART6
#else
#error Code has to be added to support serial port
#endif

#ifdef UART0_PORT
#define UART0_TX_PORT UART0_PORT
#define UART0_RX_PORT UART0_PORT
#endif

#endif // SERIAL_PORT

#if SERIAL1_PORT

#if SERIAL1_PORT == SERIAL_PORT || SERIAL1_PORT == SERIAL2_PORT
#error Conflicting use of UART peripherals!
#endif

#if (SERIAL1_PORT >= 10 && SERIAL1_PORT < 19)
#define UART1            usart(1)
#define UART1_IRQ        usartINT(1)
#define UART1_IRQHandler usartHANDLER(1)
#define UART1_CLK_En     usartCLKEN(1)
#elif (SERIAL1_PORT >= 20 && SERIAL1_PORT < 29)
#define UART1            usart(2)
#define UART1_IRQ        usartINT(2)
#define UART1_IRQHandler usartHANDLER(2)
#define UART1_CLK_En     usartCLKEN(2)
#elif (SERIAL1_PORT >= 30 && SERIAL1_PORT < 39)
#define UART1            usart(3)
#define UART1_IRQ        usartINT(3)
#define UART1_IRQHandler usartHANDLER(3)
#define UART1_CLK_En     usartCLKEN(3)
#else
#define UART1            usart(SERIAL1_PORT)
#define UART1_IRQ        usartINT(SERIAL1_PORT)
#define UART1_IRQHandler usartHANDLER(SERIAL1_PORT)
#define UART1_CLK_En     usartCLKEN(SERIAL1_PORT)
#endif
#if SERIAL1_PORT == 1 || (SERIAL1_PORT >= 10 && SERIAL1_PORT < 19) || SERIAL1_PORT == 6
#define UART1_CLK HAL_RCC_GetPCLK2Freq()
#else
#define UART1_CLK HAL_RCC_GetPCLK1Freq()
#endif

#if SERIAL1_PORT == 1
#define UART1_TX_PIN 9
#define UART1_RX_PIN 10
#define UART1_PORT GPIOA
#define UART1_AF GPIO_AF7_USART1
#elif SERIAL1_PORT == 11
#define UART1_TX_PIN 6
#define UART1_RX_PIN 7
#define UART1_PORT GPIOB
#define UART1_AF GPIO_AF7_USART1
#elif SERIAL1_PORT == 2
#define UART1_TX_PIN 2
#define UART1_RX_PIN 3
#define UART1_PORT GPIOA
#define UART1_AF GPIO_AF7_USART2
#elif SERIAL1_PORT == 21
#define UART1_TX_PIN 5
#define UART1_RX_PIN 6
#define UART1_PORT GPIOD
#define UART1_AF GPIO_AF7_USART2
#elif SERIAL1_PORT == 3
#define UART1_TX_PIN 10
#define UART1_RX_PIN 11
#define UART1_PORT GPIOB
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 31
#define UART1_TX_PIN 10
#define UART1_RX_PIN 11
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 32
#define UART1_TX_PIN 8
#define UART1_RX_PIN 9
#define UART1_PORT GPIOD
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 33
#define UART1_TX_PIN 10
#define UART1_RX_PIN 5
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 34
#define UART1_TX_PIN 8
#define UART1_RX_PIN 5
#define UART1_TX_PORT GPIOD
#define UART1_RX_PORT GPIOC
#define UART1_AF GPIO_AF7_USART3
#elif SERIAL1_PORT == 6
#define UART1_TX_PIN 6
#define UART1_RX_PIN 7
#define UART1_PORT GPIOC
#define UART1_AF GPIO_AF8_USART6
#else
#error Code has to be added to support serial port 1
#endif

#ifdef UART1_PORT
#define UART1_TX_PORT UART1_PORT
#define UART1_RX_PORT UART1_PORT
#endif

#endif // SERIAL1_PORT

#if SERIAL2_PORT

