grblHAL/STM32F4xx/Src/serial.c
#if SERIAL2_PORT == SERIAL_PORT || SERIAL2_PORT == SERIAL1_PORT
#error Conflicting use of UART peripherals!
#endif

#if (SERIAL2_PORT >= 10 && SERIAL2_PORT < 19)
#define UART2            usart(1)
#define UART2_IRQ        usartINT(1)
#define UART2_IRQHandler usartHANDLER(1)
#define UART2_CLK_En     usartCLKEN(1)
#elif (SERIAL2_PORT >= 20 && SERIAL2_PORT < 29)
#define UART2            usart(2)
#define UART2_IRQ        usartINT(2)
#define UART2_IRQHandler usartHANDLER(2)
#define UART2_CLK_En     usartCLKEN(2)
#elif (SERIAL2_PORT >= 30 && SERIAL2_PORT < 39)
#define UART2            usart(3)
#define UART2_IRQ        usartINT(3)
#define UART2_IRQHandler usartHANDLER(3)
#define UART2_CLK_En     usartCLKEN(3)
#else
#define UART2            usart(SERIAL2_PORT)
#define UART2_IRQ        usartINT(SERIAL2_PORT)
#define UART2_IRQHandler usartHANDLER(SERIAL2_PORT)
#define UART2_CLK_En     usartCLKEN(SERIAL2_PORT)
#endif
#if SERIAL2_PORT == 1 || (SERIAL2_PORT >= 10 && SERIAL2_PORT < 19) || SERIAL2_PORT == 6
#define UART2_CLK HAL_RCC_GetPCLK2Freq()
#else
#define UART2_CLK HAL_RCC_GetPCLK1Freq()
#endif

#if SERIAL2_PORT == 1
#define UART2_TX_PIN 9
#define UART2_RX_PIN 10
#define UART2_PORT GPIOA
#define UART2_AF GPIO_AF7_USART1
#elif SERIAL2_PORT == 11
#define UART2_TX_PIN 6
#define UART2_RX_PIN 7
#define UART2_PORT GPIOB
#define UART2_AF GPIO_AF7_USART1
#elif SERIAL2_PORT == 2
#define UART2_TX_PIN 2
#define UART2_RX_PIN 3
#define UART2_PORT GPIOA
#define UART2_AF GPIO_AF7_USART2
#elif SERIAL2_PORT == 21
#define UART2_TX_PIN 5
#define UART2_RX_PIN 6
#define UART2_PORT GPIOD
#define UART2_AF GPIO_AF7_USART2
#elif SERIAL2_PORT == 3
#define UART2_TX_PIN 10
#define UART2_RX_PIN 11
#define UART2_PORT GPIOB
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 31
#define UART2_TX_PIN 10
#define UART2_RX_PIN 11
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 32
#define UART2_TX_PIN 8
#define UART2_RX_PIN 9
#define UART2_PORT GPIOD
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 33
#define UART2_TX_PIN 10
#define UART2_RX_PIN 5
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL_PORT == 34
#define UART2_TX_PIN 8
#define UART2_RX_PIN 5
#define UART2_TX_PORT GPIOD
#define UART2_RX_PORT GPIOC
#define UART2_AF GPIO_AF7_USART3
#elif SERIAL2_PORT == 6
#define UART2_TX_PIN 6
#define UART2_RX_PIN 7
#define UART2_PORT GPIOC
#define UART2_AF GPIO_AF8_USART6
#else
#error Code has to be added to support serial port 2
#endif

#ifdef UART2_PORT
#define UART2_TX_PORT UART2_PORT
#define UART2_RX_PORT UART2_PORT
#endif

#endif // SERIAL2_PORT

#if SERIAL_PORT

static bool uart_release (uint8_t instance);
static const io_stream_status_t *get_uart_status (uint8_t instance);

static io_stream_status_t stream_status[] = {
#if SERIAL_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    },
#endif
#if SERIAL1_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    },
#endif
#if SERIAL2_PORT
    {
        .baud_rate = 115200,
        .format = {
            .width = Serial_8bit,
            .stopbits = Serial_StopBits1,
            .parity = Serial_ParityNone,
        }
    }
#endif
};

static io_stream_properties_t serial[] = {
#if SERIAL_PORT
    {
      .type = StreamType_Serial,
      .instance = 0,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serialInit,
      .release = uart_release,
      .get_status = get_uart_status
    },
#endif
#if SERIAL1_PORT
    {
      .type = StreamType_Serial,
      .instance = 1,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serial1Init,
      .release = uart_release,
      .get_status = get_uart_status
    },
#endif
#if SERIAL2_PORT
    {
      .type = StreamType_Serial,
      .instance = 2,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serial2Init,
      .release = uart_release,
      .get_status = get_uart_status
    }
#endif
};

void serialRegisterStreams (void)
{
    static io_stream_details_t streams = {
        .n_streams = sizeof(serial) / sizeof(io_stream_properties_t),
        .streams = serial,
    };

#if SERIAL_PORT

    static const periph_pin_t tx0 = {
        .function = Output_TX,
        .group = PinGroup_UART + 0,
        .port  = UART0_TX_PORT,
        .pin   = UART0_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx0 = {
        .function = Input_RX,
        .group = PinGroup_UART + 0,
        .port = UART0_RX_PORT,
        .pin = UART0_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx0);
    hal.periph_port.register_pin(&tx0);

#endif

#if SERIAL1_PORT

    static const periph_pin_t tx1 = {
        .function = Output_TX,
        .group = PinGroup_UART + 1,
        .port  = UART1_TX_PORT,
        .pin   = UART1_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx1 = {
        .function = Input_RX,
        .group = PinGroup_UART + 1,
        .port = UART1_RX_PORT,
        .pin = UART1_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx1);
    hal.periph_port.register_pin(&tx1);

#endif

#if SERIAL2_PORT

    static const periph_pin_t tx2 = {
        .function = Output_TX,
        .group = PinGroup_UART + 2,
        .port  = UART2_TX_PORT,
        .pin   = UART2_TX_PIN,
        .mode  = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx2 = {
        .function = Input_RX,
        .group = PinGroup_UART + 2,
        .port = UART2_RX_PORT,
        .pin = UART2_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx2);
    hal.periph_port.register_pin(&tx2);

#endif

    stream_register_streams(&streams);
}

static const io_stream_status_t *get_uart_status (uint8_t instance)
{
    stream_status[instance].flags = serial[instance].flags;

    return &stream_status[instance];
}

static bool uart_release (uint8_t instance)
{
    bool ok;

    if((ok = serial[instance].flags.claimed))
        serial[instance].flags.claimed = Off;

    return ok;
}

#ifdef RS485_DIR_PORT

static void rs485SetDirection (bool tx)
{
    DIGITAL_OUT(RS485_DIR_PORT, RS485_DIR_PIN, tx);
}

#endif // RS485_DIR_PORT

#else

void serialRegisterStreams (void) {}; // No serial ports!

#endif

#if SERIAL_PORT

//
// Returns number of free characters in serial input buffer
//
static uint16_t serialRxFree (void)
{
    uint16_t tail = rxbuf.tail, head = rxbuf.head;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Returns number of characters in serial input buffer
//
static uint16_t serialRxCount (void)
{
    uint32_t tail = rxbuf.tail, head = rxbuf.head;

