grblHAL/STM32F4xx/Src/serial.c
    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Flushes the serial input buffer
//
static void serialRxFlush (void)
{
    rxbuf.tail = rxbuf.head;
}

//
// Flushes and adds a CAN character to the serial input buffer
//
static void serialRxCancel (void)
{
    rxbuf.data[rxbuf.head] = ASCII_CAN;
    rxbuf.tail = rxbuf.head;
    rxbuf.head = BUFNEXT(rxbuf.head, rxbuf);
}

//
// Writes a character to the serial output stream
//
static bool serialPutC (const uint8_t c)
{
    uint16_t next_head = BUFNEXT(txbuf.head, txbuf);    // Get pointer to next free slot in buffer

    while(txbuf.tail == next_head) {                    // While TX buffer full
        if(!hal.stream_blocking_callback())             // check if blocking for space,
            return false;                               // exit if not (leaves TX buffer in an inconsistent state)
    }
    txbuf.data[txbuf.head] = c;                         // Add data to buffer,
    txbuf.head = next_head;                             // update head pointer and
    UART0->CR1 |= USART_CR1_TXEIE;                      // enable TX interrupts

    return true;
}

//
// Writes a null terminated string to the serial output stream, blocks if buffer full
//
static void serialWriteS (const char *s)
{
    uint8_t c, *ptr = (uint8_t *)s;

    while((c = *ptr++) != '\0')
        serialPutC(c);
}

//
// Writes a number of characters from string to the serial output stream followed by EOL, blocks if buffer full
//
static void serialWrite (const uint8_t *s, uint16_t length)
{
    uint8_t *ptr = (uint8_t *)s;

    while(length--)
        serialPutC(*ptr++);
}

//
// Flushes the serial output buffer
//
static void serialTxFlush (void)
{
    UART0->CR1 &= ~USART_CR1_TXEIE;     // Disable TX interrupts
    txbuf.tail = txbuf.head;
}

//
// Returns number of characters pending transmission
//
static uint16_t serialTxCount (void)
{
    uint32_t tail = txbuf.tail, head = txbuf.head;

    return BUFCOUNT(head, tail, TX_BUFFER_SIZE) + (UART0->SR & USART_SR_TC ? 0 : 1);
}

//
// serialGetC - returns -1 if no data available
//
static int32_t serialGetC (void)
{
    uint_fast16_t tail = rxbuf.tail;            // Get buffer pointer

    if(tail == rxbuf.head)
        return -1; // no data available

    int32_t data = (int32_t)rxbuf.data[tail];   // Get next character
    rxbuf.tail = BUFNEXT(tail, rxbuf);          // and update pointer

    return data;
}

static bool serialSuspendInput (bool suspend)
{
    return stream_rx_suspend(&rxbuf, suspend);
}

static bool serialSetBaudRate (uint32_t baud_rate)
{
    stream_status[0].baud_rate = baud_rate;

    UART0->CR1 &= ~(USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_RE|USART_CR1_TE);
    UART0->BRR = UART_BRR_SAMPLING16(UART0_CLK, baud_rate);
    UART0->CR1 |= (USART_CR1_RE|USART_CR1_TE|USART_CR1_UE|USART_CR1_RXNEIE);

    return true;
}

static bool serialSetFormat (serial_format_t format)
{
    stream_status[0].format = format;

    UART0->CR1 &= ~(USART_CR1_M|USART_CR1_PCE|USART_CR1_PS);

    if(format.parity != Serial_ParityNone)
        UART0->CR1 |= (format.parity == Serial_ParityEven ? (USART_CR1_M|USART_CR1_PCE) : (USART_CR1_M|USART_CR1_PCE|USART_CR1_PS));

    return true;
}

static bool serialDisable (bool disable)
{
    if(disable)
        UART0->CR1 &= ~USART_CR1_RXNEIE;
    else
        UART0->CR1 |= USART_CR1_RXNEIE;

    return true;
}

static bool serialEnqueueRtCommand (uint8_t c)
{
    return enqueue_realtime_command(c);
}

static enqueue_realtime_command_ptr serialSetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command;

    if(handler)
        enqueue_realtime_command = handler;

    return prev;
}

static const io_stream_t *serialInit (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 0,
        .is_connected = stream_connected,
        .read = serialGetC,
        .write = serialWriteS,
        .write_n =  serialWrite,
        .write_char = serialPutC,
        .enqueue_rt_command = serialEnqueueRtCommand,
        .get_rx_buffer_free = serialRxFree,
        .get_rx_buffer_count = serialRxCount,
        .get_tx_buffer_count = serialTxCount,
        .reset_write_buffer = serialTxFlush,
        .reset_read_buffer = serialRxFlush,
        .cancel_read_buffer = serialRxCancel,
        .suspend_read = serialSuspendInput,
        .disable_rx = serialDisable,
        .set_baud_rate = serialSetBaudRate,
        .set_format = serialSetFormat,
#if MODBUS_RTU_STREAM == 0 && defined(RS485_DIR_PORT)
        .set_direction = rs485SetDirection,
#endif
        .set_enqueue_rt_handler = serialSetRtHandler
    };

    if(!serial[0].flags.claimable || serial[0].flags.claimed)
        return NULL;

    serial[0].flags.claimed = On;

    if(!serial[0].flags.init_ok) {

        UART0_CLK_En();

#ifdef UART0_PORT

        GPIO_InitTypeDef GPIO_InitStructure = {
            .Mode      = GPIO_MODE_AF_PP,
            .Pull      = GPIO_NOPULL,
            .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
            .Pin       = (1 << UART0_RX_PIN)|(1 << UART0_TX_PIN),
            .Alternate = UART0_AF
        };
        HAL_GPIO_Init(UART0_PORT, &GPIO_InitStructure);

#else

        GPIO_InitTypeDef GPIO_InitStructure = {
            .Mode      = GPIO_MODE_AF_PP,
            .Pull      = GPIO_NOPULL,
            .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
            .Pin       = (1 << UART0_TX_PIN),
            .Alternate = UART0_AF
        };
        HAL_GPIO_Init(UART0_TX_PORT, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = (1 << UART0_RX_PIN),
        HAL_GPIO_Init(UART0_RX_PORT, &GPIO_InitStructure);

#endif

        HAL_NVIC_SetPriority(UART0_IRQ, 1, 0);
        HAL_NVIC_EnableIRQ(UART0_IRQ);

        serial[0].flags.init_ok = On;
    }

    stream_set_defaults(&stream, baud_rate);

    return &stream;
}

void UART0_IRQHandler (void)
{
    if(UART0->SR & USART_SR_RXNE) {
        uint32_t data = UART0->DR;
        if(!enqueue_realtime_command((uint8_t)data)) {          // Check and strip realtime commands...
            uint16_t next_head = BUFNEXT(rxbuf.head, rxbuf);    // Get and increment buffer pointer
            if(next_head == rxbuf.tail)                         // If buffer full
                rxbuf.overflow = 1;                             // flag overflow
            else {
                rxbuf.data[rxbuf.head] = (uint8_t)data;         // if not add data to buffer
                rxbuf.head = next_head;                         // and update pointer
            }
        }
    }

    if((UART0->SR & USART_SR_TXE) && (UART0->CR1 & USART_CR1_TXEIE)) {
        uint_fast16_t tail = txbuf.tail;            // Get buffer pointer
        UART0->DR = txbuf.data[tail];               // Send next character
        txbuf.tail = tail = BUFNEXT(tail, txbuf);   // and increment pointer
        if(tail == txbuf.head)                      // If buffer empty then
            UART0->CR1 &= ~USART_CR1_TXEIE;         // disable UART TX interrupt
   }
}

#endif // SERIAL_PORT

