grblHAL/STM32F4xx/Src/serial.c
#if SERIAL1_PORT

//
// Returns number of free characters in serial input buffer
//
static uint16_t serial1RxFree (void)
{
    uint32_t tail = rxbuf1.tail, head = rxbuf1.head;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Returns number of characters in serial input buffer
//
static uint16_t serial1RxCount (void)
{
    uint32_t tail = rxbuf1.tail, head = rxbuf1.head;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

//
// Flushes the serial input buffer
//
static void serial1RxFlush (void)
{
    rxbuf1.tail = rxbuf1.head;
}

//
// Flushes and adds a CAN character to the serial input buffer
//
static void serial1RxCancel (void)
{
    rxbuf1.data[rxbuf1.head] = ASCII_CAN;
    rxbuf1.tail = rxbuf1.head;
    rxbuf1.head = BUFNEXT(rxbuf1.head, rxbuf1);
}

//
// Writes a character to the serial output stream
//
static bool serial1PutC (const uint8_t c)
{
    uint32_t next_head = BUFNEXT(txbuf1.head, txbuf1);   // Set and update head pointer

    while(txbuf1.tail == next_head) {           // While TX buffer full
        if(!hal.stream_blocking_callback())     // check if blocking for space,
            return false;                       // exit if not (leaves TX buffer in an inconsistent state)
        UART1->CR1 |= USART_CR1_TXEIE;          // Enable TX interrupts???
    }

    txbuf1.data[txbuf1.head] = c;               // Add data to buffer
    txbuf1.head = next_head;                    // and update head pointer

    UART1->CR1 |= USART_CR1_TXEIE;              // Enable TX interrupts

    return true;
}

//
// Writes a null terminated string to the serial output stream, blocks if buffer full
//
static void serial1WriteS (const char *s)
{
    uint8_t c, *ptr = (uint8_t *)s;

    while((c = *ptr++) != '\0')
        serial1PutC(c);
}

// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
static void serial1Write (const uint8_t *s, uint16_t length)
{
    uint8_t *ptr = (uint8_t *)s;

    while(length--)
        serial1PutC(*ptr++);
}

//
// Flushes the serial output buffer
//
static void serial1TxFlush (void)
{
    UART1->CR1 &= ~USART_CR1_TXEIE;     // Disable TX interrupts
    txbuf1.tail = txbuf1.head;
}

//
// Returns number of characters pending transmission
//
static uint16_t serial1TxCount (void)
{
    uint32_t tail = txbuf1.tail, head = txbuf1.head;

    return BUFCOUNT(head, tail, TX_BUFFER_SIZE) + (UART1->SR & USART_SR_TC ? 0 : 1);
}

//
// serialGetC - returns -1 if no data available
//
static int32_t serial1GetC (void)
{
    uint_fast16_t tail = rxbuf1.tail;           // Get buffer pointer

    if(tail == rxbuf1.head)
        return -1; // no data available

    int32_t data =(int32_t) rxbuf1.data[tail];  // Get next character
    rxbuf1.tail = BUFNEXT(tail, rxbuf1);        // and update pointer

    return data;
}

static bool serial1SuspendInput (bool suspend)
{
    return stream_rx_suspend(&rxbuf1, suspend);
}

static bool serial1SetBaudRate (uint32_t baud_rate)
{
    stream_status[1].baud_rate = baud_rate;

    UART1->CR1 &= ~(USART_CR1_UE|USART_CR1_RXNEIE|USART_CR1_RE|USART_CR1_TE);
    UART1->BRR = UART_BRR_SAMPLING16(UART1_CLK, baud_rate);
    UART1->CR1 |= (USART_CR1_RE|USART_CR1_TE|USART_CR1_UE|USART_CR1_RXNEIE);

    return true;
}

static bool serial1SetFormat (serial_format_t format)
{
    stream_status[1].format = format;

    UART1->CR1 &= ~(USART_CR1_M|USART_CR1_PCE|USART_CR1_PS);

    if(format.parity != Serial_ParityNone)
        UART1->CR1 |= (format.parity == Serial_ParityEven ? (USART_CR1_M|USART_CR1_PCE) : (USART_CR1_M|USART_CR1_PCE|USART_CR1_PS));

    return true;
}

static bool serial1Disable (bool disable)
{
    if(disable)
        UART1->CR1 &= ~USART_CR1_RXNEIE;
    else
        UART1->CR1 |= USART_CR1_RXNEIE;

    return true;
}

static bool serial1EnqueueRtCommand (uint8_t c)
{
    return enqueue_realtime_command1(c);
}

static enqueue_realtime_command_ptr serial1SetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command1;

    if(handler)
        enqueue_realtime_command1 = handler;

    return prev;
}

static const io_stream_t *serial1Init (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 1,
        .is_connected = stream_connected,
        .read = serial1GetC,
        .write = serial1WriteS,
        .write_n =  serial1Write,
        .write_char = serial1PutC,
        .enqueue_rt_command = serial1EnqueueRtCommand,
        .get_rx_buffer_free = serial1RxFree,
        .get_rx_buffer_count = serial1RxCount,
        .get_tx_buffer_count = serial1TxCount,
        .reset_write_buffer = serial1TxFlush,
        .reset_read_buffer = serial1RxFlush,
        .cancel_read_buffer = serial1RxCancel,
        .suspend_read = serial1SuspendInput,
        .disable_rx = serial1Disable,
        .set_baud_rate = serial1SetBaudRate,
        .set_format = serial1SetFormat,
#if MODBUS_RTU_STREAM == 1 && defined(RS485_DIR_PORT)
        .set_direction = rs485SetDirection,
#endif
        .set_enqueue_rt_handler = serial1SetRtHandler
    };

    if(!serial[1].flags.claimable || serial[1].flags.claimed)
        return NULL;

    serial[1].flags.claimed = On;

    if(!serial[1].flags.init_ok) {

        UART1_CLK_En();

#ifdef UART1_PORT

        GPIO_InitTypeDef GPIO_InitStructure = {
            .Mode      = GPIO_MODE_AF_PP,
            .Pull      = GPIO_NOPULL,
            .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
            .Pin       = (1 << UART1_RX_PIN)|(1 << UART1_TX_PIN),
            .Alternate = UART1_AF
        };
        HAL_GPIO_Init(UART1_PORT, &GPIO_InitStructure);

#else

        GPIO_InitTypeDef GPIO_InitStructure = {
            .Mode      = GPIO_MODE_AF_PP,
            .Pull      = GPIO_NOPULL,
            .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
            .Pin       = (1 << UART1_TX_PIN),
            .Alternate = UART1_AF
        };
        HAL_GPIO_Init(UART1_TX_PORT, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = (1 << UART1_RX_PIN),
        HAL_GPIO_Init(UART1_RX_PORT, &GPIO_InitStructure);

#endif

        HAL_NVIC_SetPriority(UART1_IRQ, 1, 0);
        HAL_NVIC_EnableIRQ(UART1_IRQ);

        serial[1].flags.init_ok = On;
    }

    stream_set_defaults(&stream, baud_rate);

    return &stream;
}

